ХМНПФ_Общее/Documents/уп_РешениеОВыплатеСредствПенсионныхНакоплений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РешениеОВыплатеСредствПенсионныхНакоплений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяВыплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНаСчете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОснованиеПередачиСредств</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаМатКапиталаНаСчетеСрочныхВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйФондРФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьАналитикуРешение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВРезервеОПС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаМатКапитала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НеПроверять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заявления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заявление</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_ЗаявлениеПравопреемникаОВыплатеОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Правопреемник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Разрешить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаГарантированная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВосполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВозмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_ДатаВыплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники31</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заявление</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_ЗаявлениеПравопреемникаОВыплатеОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Правопреемник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаМК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Разрешить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Отказы</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ВидыДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВидыДеятельности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РешениеОВыплатеСредствПенсионныхНакоплений/Forms/уф_ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ДоговорОПСПриИзмененииНаСервере")
Процедура ХМДоговорОПСПриИзмененииНаСервере()

	Объект.Заявления.Очистить();
	Объект.РасшифровкаСуммы.Очистить();
	Объект.Правопреемники31.Очистить();
	#Вставка 
	// +ХМНПФ 12.11.2015 Шадрин А.В. // ДоговорОПСПриИзменении() // №37
	Объект.ХМ_Отказы.Очистить();
	// -ХМНПФ 12.11.2015 Шадрин А.В. // ДоговорОПСПриИзменении() // №37
    #КонецВставки
		
	мОбъект=РеквизитФормыВЗначение("Объект");

	мОбъект.Участник = мОбъект.ДоговорОПС.Участник;
	ПодразделениеОрганизации = мОбъект.ДоговорОПС.ПодразделениеБУ;
	//ds
	Соответствие = мОбъект.ЗаполнитьТЧДокумента();  
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	Элементы.ТекСумма.Заголовок = "Сумма:     "+Строка(Соответствие.Получить("ТекСумма"));
	Элементы.ТекСуммаМК.Заголовок = "Материнский капитал:     "+Строка(Соответствие.Получить("ТекСуммаМК"));
	Элементы.ТекСуммаМКВыплатной.Заголовок = "Материнский капитал на счете срочных выплат:     "+Строка(Соответствие.Получить("ТекСуммаМКВыплатной"));
	Элементы.ТекСуммаВРезервеОПС.Заголовок = "Сумма в резерве ОПС:     "+Строка(Соответствие.Получить("ТекСуммаВРезервеОПС"));
	//ds

	//ТекЗаявление = НайтиЗаявление();
	//ЗаполнитьТекстПроЗаявление(ТекЗаявление);

	//Элементы.ПредставлениеОснования.Значение = Неопределено;
	//Элементы.ПредставлениеОснования.ВыделенныйТекст = "";

	ЗаполнитьТекстПроЗаявление();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		//уп_ОсновнаяПоставкаСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь());  ???????
		Если НЕ (ЗначениеЗаполнено(Объект.Организация)) Тогда
			//Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		КонецЕсли;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.уп_ВидДеятельности = уп_ОсновнаяПоставкаСервер.ВидДеятельностиПоТипу(Перечисления.уп_ВидыДеятельности.ОПС);
		Объект.ДатаВыплаты = Объект.Дата;
		Объект.ПенсионныйФондРФ = Константы.уп_ПенсионныйФондРФ.Получить();
		Объект.ИспользоватьАналитикуРешение = Истина;
	Иначе
		//заполнить ссылку на Заявление
		ЗаполнитьТекстПроЗаявление();
	КонецЕсли;

	Элементы.ТекСумма.Заголовок = "Сумма:     "+Строка(Объект.СуммаНаСчете) + " руб.";
	Элементы.ТекСуммаМК.Заголовок = "Материнский капитал:     "+Строка(Объект.СуммаМатКапитала) + " руб.";
	Элементы.ТекСуммаМКВыплатной.Заголовок = "Материнский капитал на счете срочных выплат:     "+Строка(Объект.СуммаМатКапиталаНаСчетеСрочныхВыплат) + " руб.";
	Элементы.ТекСуммаВРезервеОПС.Заголовок = "Сумма в резерве ОПС:     "+Строка(Объект.СуммаВРезервеОПС) + " руб.";


	УстановитьВидимость();
	УстановитьДоступность();
	УстановитьТекстОснования();

	Элементы.ОтражатьБУ.Заголовок = уп_ОбщегоНазначенияКлиентСервер.СформироватьНадписьБУ(Объект.ОтражатьВБухгалтерскомУчете,
	Объект.уп_ВидДеятельности, Объект.ПодразделениеОрганизации);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка	
	// +ХМНПФ 17.12.2015 Шадрин А.В. // ПриСозданииНаСервере()
	ХМ_УстановитьДействияФормы();
	// -ХМНПФ 17.12.2015 Шадрин А.В. // ПриСозданииНаСервере()
	#КонецВставки
	
КонецПроцедуры

Процедура ХМДополнитьФорму() 

	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ПредставлениеОснования",Новый ОписаниеТипов("Строка"),"Объект.ХМ_Отказы","Основание");
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ПредставлениеСтепеньРодства",Новый ОписаниеТипов("Строка"),"Объект.ХМ_Отказы","Степень родства");
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Заголовок", "Отказы");  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьСтраницу(ЭтаФорма,"Отказы",Элементы.ГруппаЗакладки,СвойстваПоля);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьТаблицуФормы(ЭтаФорма,"ХМ_Отказы",Элементы["Отказы"],"Объект.ХМ_Отказы");
   	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтказыНомерСтроки",Элементы["ХМ_Отказы"],"Объект.ХМ_Отказы.НомерСтроки");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтказыЗаявление",Элементы["ХМ_Отказы"],"Объект.ХМ_Отказы.Заявление");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтказыПравопреемник",Элементы["ХМ_Отказы"],"Объект.ХМ_Отказы.Правопреемник");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтказыОснование",Элементы["ХМ_Отказы"],"Объект.ХМ_Отказы.Основание"); 
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтказыОснованиеПредставление",Элементы["ХМ_Отказы"],"Объект.ХМ_Отказы.ПредставлениеОснования");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтказыСтепеньРодства",Элементы["ХМ_Отказы"],"Объект.ХМ_Отказы.СтепеньРодства");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтказыСтепеньРодстваПредставление",Элементы["ХМ_Отказы"],"Объект.ХМ_Отказы.ПредставлениеСтепеньРодства");
	Элементы["ХМ_ОтказыОснование"].Видимость = Ложь;
	Элементы["ХМ_ОтказыСтепеньРодства"].Видимость = Ложь;
		
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.Организация);  
	СвойстваПоля.Вставить("ЦветТекстаЗаголовка", ЦветаСтиля.ЦветОсобогоТекста); 
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_НеПроверять",ЭтаФорма,"Объект.ХМ_НеПроверять",СвойстваПоля);
	
	уп_ДинамическиеЭлементыСервер.ХМ_УставноитьДействие(Элементы["ХМ_Отказы"],"ПриИзменении","ХМ_ОтказыПриИзменении");
	уп_ДинамическиеЭлементыСервер.ХМ_УставноитьДействие(Элементы["ХМ_ОтказыЗаявление"],"ПриИзменении","ХМ_ОтказыЗаявлениеПриИзменении");	
	
КонецПроцедуры  

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры 

// ХМНПФ 12.11.2015 ШадринАВ // ХМ_ОтказыПриВыводеСтроки() // №37
&НаСервере
Процедура  ХМ_ОтказыПриВыводеСтроки()
	
	мСписокВыбораОснования = Новый СписокЗначений;
	мСписокВыбораОснования.Добавить("Договор","По договору (заявлению)");
	мСписокВыбораОснования.Добавить("Закон","По закону");
	
	мСписокСтепеньРодства = Новый СписокЗначений;
	мСписокСтепеньРодства.Добавить("СынДочь","сын/дочь");
	мСписокСтепеньРодства.Добавить("СупругСупруга","супруг/супруга");
	мСписокСтепеньРодства.Добавить("МатьОтец","мать/отец");
	мСписокСтепеньРодства.Добавить("БратСестра","брат/сестра");
	мСписокСтепеньРодства.Добавить("ДедушкаБабушка","дедушка/бабушка");
	мСписокСтепеньРодства.Добавить("ВнукВнучка","внук/внучка");
	
	Для каждого Стр из  Объект.ХМ_Отказы Цикл		
		Если  Стр.Заявление.Основание <> 0 Тогда
			Стр.ПредставлениеОснования =  мСписокВыбораОснования.Получить(Стр.Заявление.Основание-1).Представление;
		КонецЕсли;
		
		Если  Стр.Заявление.СтепеньРодства <> 0 Тогда
			Стр.ПредставлениеСтепеньРодства =  мСписокСтепеньРодства.Получить(Стр.Заявление.СтепеньРодства-1).Представление;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

// ХМНПФ 12.11.2015 ШадринАВ // ХМ_ОтказыПриВыводеСтроки() // №37
&НаСервере
Процедура  ХМ_ЗаявленияПриВыводеСтроки()
	
	мСписокВыбораОснования = Новый СписокЗначений;
	мСписокВыбораОснования.Добавить("Договор","По договору (заявлению)");
	мСписокВыбораОснования.Добавить("Закон","По закону");
	
	мСписокСтепеньРодства = Новый СписокЗначений;
	мСписокСтепеньРодства.Добавить("СынДочь","сын/дочь");
	мСписокСтепеньРодства.Добавить("СупругСупруга","супруг/супруга");
	мСписокСтепеньРодства.Добавить("МатьОтец","мать/отец");
	мСписокСтепеньРодства.Добавить("БратСестра","брат/сестра");
	мСписокСтепеньРодства.Добавить("ДедушкаБабушка","дедушка/бабушка");
	мСписокСтепеньРодства.Добавить("ВнукВнучка","внук/внучка");
	
	мСписокПричинаОтказа = НОвый СписокЗначений;
	мСписокПричинаОтказа.Добавить("1", "Не является правопреемником");
	мСписокПричинаОтказа.Добавить("2", "Наличие заявлений по закону 1-ой очереди");
	мСписокПричинаОтказа.Добавить("3", "По истечении срока");
	мСписокПричинаОтказа.Добавить("4", "Наличие правопреемника по пп.'а' п.3(1)");
	мСписокПричинаОтказа.Добавить("5", "Ранее произведена выплата");
	мСписокПричинаОтказа.Добавить("6", "Средства состоят из МК и ИД МК");
	мСписокПричинаОтказа.Добавить("7", "Назначена пенсия по старости");
	мСписокПричинаОтказа.Добавить("8", "Средства перечислены в резерв ПФР до 01.07.2012");	
	
	Для каждого Стр из  Объект.Заявления Цикл		
		Если  Стр.Заявление.Основание <> 0 Тогда
			Стр.ПредставлениеОснования =  мСписокВыбораОснования.Получить(Стр.Заявление.Основание-1).Представление;
		КонецЕсли;
		
		Если  Стр.Заявление.СтепеньРодства <> 0 Тогда
			Стр.ПредставлениеСтепеньРодства =  мСписокСтепеньРодства.Получить(Стр.Заявление.СтепеньРодства-1).Представление;
		КонецЕсли;	
		
		Если Стр.ПричинаОтказа<>0 Тогда
			Стр.ПредставлениеПричинаОтказа = ""+мСписокПричинаОтказа.НайтиПоЗначению(Строка(Стр.ПричинаОтказа))+": №"+Стр.ПричинаОтказа;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// ХМНПФ 12.11.2015 ШадринАВ // новый ХМ_ОтказыПриИзменении() // №37
&НаКлиенте
Процедура ХМ_ОтказыПриИзменении(Элемент)
	ХМ_ОтказыПриВыводеСтроки();
КонецПроцедуры

// ХМНПФ 12.11.2015 ШадринАВ // новый ХМ_ОтказыЗаявлениеПриИзменении() // №37
&НаКлиенте
Процедура ХМ_ОтказыЗаявлениеПриИзменении(Элемент)
	ТекДанные = Элементы.ХМ_Отказы.ТекущиеДанные;
	ТекДанные.Правопреемник = ПолучитьПравоприемника(ТекДанные.Заявление);
КонецПроцедуры

// ХМНПФ 12.11.2015 ШадринАВ // новый ЗаявленияПриИзменении() // №37
&НаКлиенте
Процедура ЗаявленияПриИзменении(Элемент)
	ХМ_ЗаявленияПриВыводеСтроки();
КонецПроцедуры

// ХМНПФ 25.02.2016 Шадрин А.В. // Новая ХМ_ДействияФормыПересчитать() // №231
&НаКлиенте
Процедура ХМ_ДействияФормыПересчитать(Команда)
	Если Объект.Проведен Тогда
		Ответ = Вопрос("Пересчитать можно только непроведенный документ. Отменить проведение?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Вопрос");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			//Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Пересчитать(Команда);
КонецПроцедуры

// ХМНПФ 17.12.2015 Шадрин А.В. // Новая ХМ_УстановитьДействияФормы()
&НаСервере
Процедура ХМ_УстановитьДействияФормы()
	// +ХМНПФ 07.02.2018 КлименкоМИ // ХМ_УстановитьДействияФормы() // №1352
	Элементы.Заявления.УстановитьДействие("ПриИзменении","ЗаявленияПриИзменении");
	// -ХМНПФ 07.02.2018 КлименкоМИ // ХМ_УстановитьДействияФормы() // №1352
	//Элементы.Заявления.УстановитьДействие("ПриВыводеСтроки","ХМ_ЗаявленияПриВыводеСтроки");
	// ХМНПФ 25.02.2016 Шадрин А.В. // ХМ_УстановитьДействияФормы() // №231
	Команды.Пересчитать.Действие = "ХМ_ДействияФормыПересчитать";
КонецПроцедуры

// ХМНПФ 17.12.2015 Шадрин А.В. // Новая ХМ_ПриОткрытии()
&НаКлиенте
Процедура ХМ_ПриОткрытии(Отказ)
	
	// ХМНПФ 17.12.2015 Шадрин А.В. // ХМ_ПриОткрытии()  // №105
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОтражатьВБухгалтерскомУчете = Ложь;
	КонецЕсли;
	// ХМНПФ 29.01.2016 Шадрин А.В. // ХМ_ПриОткрытии()  // №167
	Элементы.Правопреемники32Заявление.КнопкаОткрытия = Истина;
	
	// ХМНПФ 12.11.2015 ШадринАВ // ПриОткрытии() // №37
	ХМ_ОтказыПриВыводеСтроки();	
	ХМ_ЗаявленияПриВыводеСтроки();
	// ХМНПФ 12.11.2015 ШадринАВ // ПриОткрытии() // №37

КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 12.11.2015 Шадрин А.В. // Новая вкладка Отказы и табличное поле Отказы // №37
	// ХМНПФ 12.11.2015 Шадрин А.В. // ДоговорОПСПриИзменении() // №37
	// ХМНПФ 12.11.2015 ШадринАВ // Новая ХМ_ОтказыПриИзменении() // №37
	// ХМНПФ 12.11.2015 ШадринАВ // Новая ХМ_ОтказыЗаявлениеПриИзменении() // №37
	// ХМНПФ 12.11.2015 ШадринАВ // Новая ЗаявленияПриИзменении() // №37	
	// ХМНПФ 12.11.2015 Шадрин А.В. // Новая ОтказыПриВыводеСтроки() // №37	
	// ХМНПФ 17.12.2015 Шадрин А.В. // ПриСозданииНаСервере()
	// ХМНПФ 17.12.2015 Шадрин А.В. // Новая ХМ_ПриОткрытии()	
	// ХМНПФ 17.12.2015 Шадрин А.В. // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 20.01.2016 Лыткин А.М. // Новая ХМ_ЗаявленияПриВыводеСтроки()
	// ХМНПФ 25.02.2016 Шадрин А.В. // Новая ХМ_ДействияФормыПересчитать() // №231
	// ХМНПФ 07.02.2018 КлименкоМИ // Правопреемники32ПриОкончанииРедактирования() // №1352
	// ХМНПФ 07.02.2018 КлименкоМИ // ХМ_УстановитьДействияФормы() // №1352
КонецПроцедуры

&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	ХМ_ПриОткрытии(Отказ);
КонецПроцедуры
